<unk>
<blank>
<s>
</s>
(
)
.
{
}
;
,
public
=
String
void
private
final
int
static
new
<
[
]
>
@
if
boolean
throws
+
null
protected
Override
class
0
return
i
this
<START_BUG>
<END_BUG>
==
Object
!=
1
List
Exception
extends
else
IOException
:
false
e
name
true
get
&&
long
length
?
-
!
double
context
for
value
File
Map
add
Test
implements
ModelNode
id
char
append
++
equals
toString
catch
Integer
ArrayList
try
throw
type
byte
System
index
Class
result
||
getName
size
case
2
out
T
event
log
break
x
key
OS
float
scope
parent
put
args
println
""
data
file
*
node
org
c
message
abstract
y
path
s
reader
request
item
Set
synchronized
start
model
instanceof
j
HashMap
Logger
info
SWT
JavaModelException
response
writer
target
Collection
set
assertEquals
close
operation
element
View
buffer
getValue
while
3
method
binding
listener
SQLException
end
p
getString
url
TypeBinding
field
msg
StringBuffer
t
Long
Context
b
/
logger
ctx
error
width
text
+=
v
4
Vector
execute
Component
ex
Path
&
Boolean
player
r
entry
getLogger
state
position
setText
next
count
project
config
input
height
params
BlockScope
user
style
short
list
ReferenceBinding
builder
SuppressWarnings
component
ASTNode
source
offset
Message
address
create
doc
line
Color
run
...
super
Throwable
Node
sb
format
res
debug
getInstance
INSTANCE
XMLStreamException
BuildException
tag
a
f
isEmpty
>=
5
Bundle
IJavaElement
view
write
o
Button
contains
d
dir
Point
codeStream
10
container
Date
handle
resource
in
serialVersionUID
|
Element
page
output
query
Expression
substring
m
remove
MethodBinding
Composite
ID
iterator
InputStream
Math
IllegalArgumentException
string
OperationFailedException
Control
values
getMessage
getId
currentScope
options
Type
n
IPath
findViewById
root
command
map
visit
StandardException
TextView
assertTrue
Log
Hashtable
handler
Thread
location
init
StringBuilder
valueOf
Double
Iterator
token
object
URL
obj
Image
monitor
Event
IProgressMonitor
Intent
getText
pos
str
store
continue
getType
K
InterruptedException
User
savedInstanceState
OperationContext
fileName
Locale
Player
main
of
V
display
random
table
service
column
getClass
indexOf
buf
max
expression
"unchecked"
clazz
child
printStackTrace
controller
IType
CharSequence
rect
apache
finally
problemReporter
cmd
getProperty
parameters
deploymentUnit
image
switch
parser
session
E
Document
client
l
build
Method
arg
Resource
<=
HashSet
row
sel
filter
locale
Assert
status
Rectangle
CoreException
content
"<seq2seq4repair_space>"
Properties
arguments
expected
TreeItem
instance
XMLExtendedStreamReader
w
gc
ServiceName
req
IResource
HttpServletRequest
Constants
action
environment
uri
Util
Shell
hasNext
1L
lParam
prefix
Void
conf
filename
Runnable
className
k
setValue
at
FlowInfo
label
description
wParam
onCreate
InetAddress
exists
configuration
8
world
port
IModel
Page
control
layout
jboss
clear
pattern
Autowired
val
100
Menu
Serializable
other
intent
parse
menu
server
Calendar
RuntimeException
title
group
newline
volatile
equalsIgnoreCase
cache
IllegalStateException
LOG
attributes
LoggerFactory
flowInfo
Response
getPath
JavaCore
Label
No
1000
rs
bytes
application
InjectedValue
Pattern
transient
props
PathAddress
attribute
document
widget
update
startsWith
host
left
RequestMapping
replace
Main
ClassLoader
getKey
password
manager
parseInt
items
eclipse
sender
is
level
shell
flags
connection
hashCode
read
Name
factory
JPanel
Configuration
Field
Entry
code
date
version
fields
as
asString
properties
entity
6
ActionEvent
username
setUp
color
window
conn
unit
IClasspathEntry
FieldBinding
current
JButton
cls
property
LRESULT
PathElement
Project
TaskException
Task
Display
convert
fieldName
"/"
folder
Connection
Font
Request
files
header
resolvedType
JSONObject
dispose
time
trim
iter
resolve
split
task
JLabel
mode
addDependency
err
selector
visitor
registerOperationHandler
Directory
getParent
DeploymentUnit
g
q
right
XNIException
interface
TAG
ref
reference
Table
Term
Random
Builder
URI
directory
op
sm
modifiers
array
getAbsolutePath
ServiceController
owner
show
Arrays
h
stop
print
typeName
default
encoding
BytesRef
ICompilationUnit
Result
from
reset
clone
evt
"\\n"
min
DeploymentUnitProcessingException
currentTimeMillis
onClick
OnClickListener
delta
MenuItem
match
20
Query
ItemStack
param
sql
Collections
results
NONE
plugin
Binding
Location
open
declaringClass
phaseContext
|=
HttpServletResponse
src
module
serviceTarget
delete
len
TypeDeclaration
load
Tree
tree
meta
Statement
arg0
uid
dialog
ret
IStatus
IndexReader
7
Session
UUID
core
BigDecimal
Text
getAttribute
"id"
st
GET
ByteBuffer
children
stream
QName
scanner
ComponentTag
CompilerOptions
Entity
cursor
Token
suite
loader
asList
desc
sendMessage
defaultValue
env
OutputStream
State
ClassNotFoundException
save
internal
receiverType
RequestMethod
containsKey
MarkupContainer
pc
ManagementResourceRegistration
kind
statement
initialize
setName
nextInt
--
changed
JMeterUtils
Level
bits
types
z
warn
it
search
ch
font
ResultSet
term
body
CodeStream
getLocation
addService
LinkedList
Deprecated
timeout
NotNull
16
Scope
columnIndex
requestor
getBytes
IndexWriter
ast
classpath
Activity
addDeploymentProcessor
getLog
markupStream
theEvent
RequestCycle
getInt
Attribute
game
util
TableItem
newInstance
bind
R
methods
<<
block
channel
names
addAll
argumentTypes
Application
"."
ParseException
BufferedReader
test
enabled
frame
ClassMetaData
sleep
OperationStepHandler
ps
registry
holder
arraycopy
CompilationUnitDeclaration
Block
World
col
settings
EditText
IJavaProject
setAttribute
GridData
getDefault
copy
MarkupStream
memento
db
classFile
Cursor
toCharArray
compiler
tokens
link
separator
temp
FXML
install
getProject
ImageView
attributeName
to
Augmentations
ServletException
bundle
GC
part
Item
select
Status
XMLExtendedStreamWriter
constant
hasDefined
idx
SampleResult
process
searcher
ViewGroup
operations
Action
ClassScope
actionPerformed
getContext
Value
getActivity
json
toLowerCase
keys
replaceAll
","
com
lucene
required
RequestParam
editor
Iterable
generateCode
getAttachment
activity
CommonAttributes
resolveType
compile
matches
MainActivity
"name"
charAt
Inject
commit
packageName
order
TypeReference
sessionId
metadata
callback
LOGGER
pathElement
force
valueRequired
point
setSelection
trace
headers
register
assertNotNull
getItem
Parser
Listener
Column
augs
native
PrintWriter
exception
require
setProperty
job
adapter
fail
DEBUG
elements
Enumeration
enclosingType
range
record
jdt
requestCycle
isEnabled
":"
indent
methodBinding
validate
annotation
locator
traverse
sort
contents
flowContext
u
SelectionListener
Command
SaveService
isStatic
ChatColor
Comparator
SqlException
invoke
matcher
Model
compare
processorTarget
registerSubModel
JTextField
cf
setEnabled
typeDeclaration
returnType
NAME
0.0
Reader
base
50
SUBSYSTEM_NAME
receiver
fs
ColumnFamily
MouseEvent
MAX_VALUE
getResource
255
P
accept
enum
getResult
inflater
top
Group
columns
first
stmt
stack
FileUtils
tab
ResolvedMember
provider
LogFactory
StringUtils
setVisible
sourceStart
OPERATION_NAME
toArray
CharOperation
button
setDefault
email
IFile
MESSAGES
getParameter
Float
attr
attrs
em
sourceType
setOnClickListener
getMethod
JavaProject
shutdown
JOptionPane
Nullable
compareTo
prop
%
NamingException
dest
signature
setFont
15
Number
FlowContext
IMemento
analyseCode
original
9
userId
destination
Deployment
currentType
PrintStream
TestElement
keySet
typeBinding
forName
Record
addListener
tableName
Character
FormComponent
tearDown
ServiceTarget
TestCase
getData
getChildren
ActionListener
KeyEvent
LuceneTestCase
Utils
getWidth
selection
32
TableColumn
SourceTypeBinding
docs
getTime
sourceEnd
->
ASTVisitor
Form
Commandline
entries
flush
")"
getHeight
CLOptionDescriptor
extension
terms
completeStep
ERROR
assert
getBounds
Service
hwnd
tmp
1.0
AbstractMethodDeclaration
getLength
isDisposed
Handler
IProject
IWorkbenchWindow
Module
targetType
Member
endsWith
Before
registration
MediaType
ModuleIdentifier
fetch
schema
limit
'.'
Pair
beanName
ResolvedType
local
